In [1]:
import pandas as pd 
import numpy as np

In [2]:
bronze=pd.read_csv("../datasets/bronze.csv")
silver=pd.read_csv("../datasets/silver.csv")
gold=pd.read_csv("../datasets/gold.csv")

In [3]:
bronze

          Country  Total
0   United States   1052
1    Soviet Union    584
2  United Kingdom    505
3          France    475
4         Germany    454

In [4]:
silver

          Country  Total
0   United States   1195
1    Soviet Union    627
2  United Kingdom    591
3          France    461
4           Italy    394

In [5]:
gold

          Country  Total
0   United States   2088
1    Soviet Union    838
2  United Kingdom    498
3           Italy    460
4         Germany    407

In [8]:
pd.merge(bronze,gold,on="Country")

          Country  Total_x  Total_y
0   United States     1052     2088
1    Soviet Union      584      838
2  United Kingdom      505      498
3         Germany      454      407

In [17]:
pd.merge(gold, silver, on='Country', suffixes=['_gold', "_silver"])

          Country  Total_gold  Total_silver
0   United States        2088          1195
1    Soviet Union         838           627
2  United Kingdom         498           591
3           Italy         460           394

merging dataframes

In [18]:
revenue=pd.read_csv("../datasets/revenue.csv")
revenue

          city  revenue
0       Austin      100
1       Denver       83
2  Springfield        4

In [19]:
managers=pd.read_csv("../datasets/manager.csv")
managers

        city   manager
0     Austin  Charlers
1     Denver      Joel
2  Mendocino     Brett